import json

data = {
    "Денисенко": ["Віталій", "Анатолійович", 2004],
    "Шевченко": ["Тарас", "Григорович", 1814],
    "Франко": ["Іван", "Якович", 1856],
    "Леся Українка": ["Лариса", "Петрівна", 1871],
    "Сковорода": ["Григорій", "Савич", 1722],
    "Коцюбинський": ["Михайло", "Михайлович", 1864],
    "Гончар": ["Олесь", "Терентійович", 1918],
    "Стус": ["Василь", "Семенович", 1938],
    "Хвильовий": ["Микола", "Григорович", 1893],
    "Симоненко": ["Василь", "Андрійович", 1935]
}

with open("people.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

print("Файл people.json успішно створений!")
